*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
    88 EOF VALUE HIGH-VALUES.

WORKING-STORAGE SECTION.

01 SOUMISSIONS  PIC 9(03).
01 RESTANTES    PIC 9(03).

01.
    05 WS-LIGNE-TEMP PIC X(03).
    05 WS-LIGNE-HASH PIC X(128).

01.
    05 SOUMISSION OCCURS 100 TIMES.
        10  SOUMISSION-TEMP PIC 9(03)  VALUE ZEROS.
        10  SOUMISSION-HASH PIC X(128) VALUE SPACES.

01 C-IDX    PIC 9(03) VALUE 1.
01 C-IDX-I  PIC 9(03) VALUE 1.

01 TMP.
    05 TMP-HASH PIC X(128).
    05 TMP-TEMP PIC 9(02).
    05 TMP-TEMP-AFF PIC ZZ9.

01 WS-DEBUG PIC 99 VALUE 0.
    88 AUCUN-MESSAGE   VALUE 0.
    88 DEBUT-FIN       VALUE 1 7 8 9 10 99.
    88 LECTURE         VALUE 2 99.
    88 ANALYSE         VALUE 3 7 10 99.
    88 FILTRATION      VALUE 4 7 9 10 99.
    88 COMPARAISON     VALUE 5 8 10 99.
    88 ELECTION-MIN    VALUE 6 8 9 10 99.
    88 COMPLET         VALUE 99.
01 WS-MIN-DEBUG PIC 9(03) VALUE 0.
01 WS-MAX-DEBUG PIC 9(03) VALUE 101.

PROCEDURE DIVISION.
    OPEN INPUT SYSIN

    IF DEBUT-FIN THEN
        DISPLAY "======= START PROCEDURE =======" UPON SYSERR
    END-IF

    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ

    MOVE FUNCTION NUMVAL(ln) TO SOUMISSIONS
    MOVE      SOUMISSIONS    TO RESTANTES

    READ SYSIN
        AT END SET EOF TO TRUE
    END-READ
    PERFORM UNTIL EOF
        UNSTRING ln DELIMITED BY " " INTO
            WS-LIGNE-TEMP
            WS-LIGNE-HASH
        END-UNSTRING
        MOVE FUNCTION    NUMVAL(WS-LIGNE-TEMP)  TO SOUMISSION-TEMP(C-IDX)
        MOVE FUNCTION      TRIM(WS-LIGNE-HASH)  TO SOUMISSION-HASH(C-IDX)
        IF LECTURE THEN
            DISPLAY "READING '" ln "' INTO '" SOUMISSION(C-IDX) "'" UPON SYSERR
        END-IF
        ADD 1 TO C-IDX
        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ
    END-PERFORM
    CLOSE SYSIN

    PERFORM VARYING C-IDX FROM 1 BY 1 UNTIL C-IDX > SOUMISSIONS
        IF SOUMISSION-HASH(C-IDX) NOT EQUAL SPACES THEN
            MOVE SOUMISSION-HASH(C-IDX) TO TMP-HASH
            IF ANALYSE AND WS-MIN-DEBUG <= SOUMISSIONS AND WS-MAX-DEBUG >= SOUMISSIONS THEN
                DISPLAY "ANALYSING HASH '" TMP-HASH "' (" SOUMISSION-TEMP(C-IDX) ") OF TAKE " C-IDX UPON SYSERR
            END-IF
            PERFORM VARYING C-IDX-I FROM 1 BY 1 UNTIL C-IDX-I > SOUMISSIONS
                IF TMP-HASH = SOUMISSION-HASH(C-IDX-I) AND C-IDX NOT = C-IDX-I THEN
                    IF FILTRATION AND WS-MIN-DEBUG <= SOUMISSIONS AND WS-MAX-DEBUG >= SOUMISSIONS THEN
                        DISPLAY "---- HASH '" TMP-HASH "' OF TAKE " C-IDX-I " MATCHED AND IS BEING REMOVED" UPON SYSERR
                    END-IF
                    SUBTRACT 1 FROM RESTANTES
                    MOVE SPACES TO SOUMISSION-HASH(C-IDX-I)
                    MOVE ZEROS  TO SOUMISSION-TEMP(C-IDX-I)
                    IF SOUMISSION-HASH(C-IDX) NOT EQUAL SPACES THEN
                        SUBTRACT 1 FROM RESTANTES
                        MOVE SPACES TO SOUMISSION-HASH(C-IDX)
                        MOVE ZEROS  TO SOUMISSION-TEMP(C-IDX)
                    END-IF
                END-IF
            END-PERFORM
        END-IF
    END-PERFORM

    PERFORM VARYING C-IDX FROM 1 BY 1 UNTIL C-IDX > RESTANTES

        MOVE ZERO TO TMP-TEMP
        PERFORM VARYING C-IDX-I FROM 1 BY 1 UNTIL C-IDX-I > SOUMISSIONS
            IF SOUMISSION-TEMP(C-IDX-I) NOT EQUAL ZERO THEN
                IF COMPARAISON AND WS-MIN-DEBUG <= SOUMISSIONS AND WS-MAX-DEBUG >= SOUMISSIONS THEN
                    DISPLAY "[" C-IDX "] EVALUATING VALUE " SOUMISSION-TEMP(C-IDX-I) " FOR MINIMUM AGAINST IDX " TMP-TEMP UPON SYSERR
                END-IF
                IF SOUMISSION-TEMP(C-IDX-I) < SOUMISSION-TEMP(TMP-TEMP) OR TMP-TEMP EQUAL ZERO THEN
                    IF ELECTION-MIN AND WS-MIN-DEBUG <= SOUMISSIONS AND WS-MAX-DEBUG >= SOUMISSIONS THEN
                        DISPLAY "[" C-IDX "] --- ELECTING NEW MINIMUM " SOUMISSION-TEMP(C-IDX-I) " TO DISPLAY" UPON SYSERR
                    END-IF
                    MOVE C-IDX-I TO TMP-TEMP
                END-IF
            END-IF
        END-PERFORM
        IF TMP-TEMP NOT EQUAL ZERO THEN
            MOVE SOUMISSION-TEMP(TMP-TEMP) TO TMP-TEMP-AFF
            MOVE ZEROS TO SOUMISSION-TEMP(TMP-TEMP)
            DISPLAY TMP-TEMP-AFF
        END-IF
    END-PERFORM

    IF DEBUT-FIN THEN
        DISPLAY "=======  END PROCEDURE  =======" UPON SYSERR
    END-IF

    STOP RUN.
