*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
  88 EOF VALUE HIGH-VALUES.
WORKING-STORAGE SECTION.

01 NB-COMMANDES     PIC 9(05).
01 CHARGE-MAXIMALE  PIC 9(04).

01.
    05 COMMANDES OCCURS 10000 TIMES INDEXED BY IDX-COMMANDE.
        10 LOCATION.
            15 POSX PIC S9(06).
            15 POSY PIC S9(06).
        10 PIZZAS   PIC 9(04).

01.
    05 NB-PIZZAS    PIC 9(04)  VALUE 0.
    05 TMP-NB-PIZ   PIC 9(04)  VALUE 0.
    05 NB-INDEXES   PIC 9(05)  VALUE 1.
    05 RESULTAT.
        10 OCCURS 10000 TIMES INDEXED BY POS-INDEXES.
            15 INDEXES  PIC 9(05).

01 PRINTOUT-TMP     PIC Z(04)9.
01 PRINTOUT-PTR     PIC 9(05) VALUE 0.
01 PRINTOUT         PIC X(10000) VALUE SPACES.

PROCEDURE DIVISION.
  OPEN INPUT SYSIN
  
  READ SYSIN
    AT END SET EOF TO TRUE
  END-READ
  
    UNSTRING ln DELIMITED BY " " INTO
        NB-COMMANDES
        CHARGE-MAXIMALE
    END-UNSTRING
    DISPLAY "Nb commandes = " NB-COMMANDES UPON SYSERR
    DISPLAY "Max charge   = " CHARGE-MAXIMALE UPON SYSERR
  
    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ
  PERFORM VARYING IDX-COMMANDE FROM 1 BY 1 UNTIL EOF
        UNSTRING ln DELIMITED BY SPACE INTO
            POSX(IDX-COMMANDE)
            POSY(IDX-COMMANDE)
            PIZZAS(IDX-COMMANDE)
        END-UNSTRING
    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ
  END-PERFORM
  CLOSE SYSIN
  
  
  PERFORM VARYING IDX-COMMANDE FROM 1 BY 1 UNTIL IDX-COMMANDE > NB-COMMANDES
    COMPUTE TMP-NB-PIZ = (NB-PIZZAS + PIZZAS(IDX-COMMANDE))
    IF TMP-NB-PIZ > CHARGE-MAXIMALE THEN
        MOVE 1 TO PRINTOUT-PTR
        PERFORM VARYING POS-INDEXES FROM 1 BY 1 UNTIL POS-INDEXES >= NB-INDEXES
            MOVE INDEXES(POS-INDEXES) TO PRINTOUT-TMP
            STRING
                FUNCTION TRIM(PRINTOUT-TMP)
              INTO PRINTOUT WITH POINTER PRINTOUT-PTR
            END-STRING
            ADD 1 TO PRINTOUT-PTR
        END-PERFORM
        DISPLAY PRINTOUT
        MOVE SPACE TO PRINTOUT
        
        MOVE 1 TO NB-INDEXES
        MOVE PIZZAS(IDX-COMMANDE) TO TMP-NB-PIZ
    END-IF
    MOVE TMP-NB-PIZ TO NB-PIZZAS
    MOVE IDX-COMMANDE TO INDEXES(NB-INDEXES)
    SUBTRACT 1 FROM INDEXES(NB-INDEXES)
    ADD 1 TO NB-INDEXES
  END-PERFORM
  
    IF NB-INDEXES > 0 THEN
        MOVE 1 TO PRINTOUT-PTR
        PERFORM VARYING POS-INDEXES FROM 1 BY 1 UNTIL POS-INDEXES >= NB-INDEXES
            MOVE INDEXES(POS-INDEXES) TO PRINTOUT-TMP
            STRING
                FUNCTION TRIM(PRINTOUT-TMP)
              INTO PRINTOUT WITH POINTER PRINTOUT-PTR
            END-STRING
            ADD 1 TO PRINTOUT-PTR
        END-PERFORM
        DISPLAY PRINTOUT
    END-IF
  
  STOP RUN.
