*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
    88 EOF VALUE HIGH-VALUES.

WORKING-STORAGE SECTION.

01 AFFICHAGE.
    05 SCORE-1  PIC X.
    05 SCORE-2  PIC X.
    05 SCORE-3  PIC X.

01 WS-SEGMENTS.
    05 PIC X(8) VALUE "0-******".
    05 PIC X(8) VALUE "1-----**".
    05 PIC X(8) VALUE "2***-**-".
    05 PIC X(8) VALUE "3**--***".
    05 PIC X(8) VALUE "4*--*-**".
    05 PIC X(8) VALUE "5**-**-*".
    05 PIC X(8) VALUE "6*****-*".
    05 PIC X(8) VALUE "7----***".
    05 PIC X(8) VALUE "8*******".
    05 PIC X(8) VALUE "9**-****".

01                  REDEFINES WS-SEGMENTS.
    05 DEF-SEGMENTS OCCURS 10 TIMES.
        10 SEG-VAL  PIC X.
        10 SEG-REP  PIC X(07).
        10      REDEFINES SEG-REP.
            15      OCCURS 7 TIMES.
                20 ETAT-SEGMENT PIC X.

01 ADDITION.
    05 CHIFFRE-1  PIC 9.
    05 CHIFFRE-2  PIC 9.
    05 RESULTAT   PIC 9.

01 REDEFINES ADDITION.
    05 OCCURS 3 TIMES.
        10 WS-ELEMENT PIC 9.
01 IDX-ELEMENT PIC 9.

01.
    05 WS-TMP-SEGMENTS  PIC X(07).
    05      REDEFINES WS-TMP-SEGMENTS.
        10      OCCURS 7 TIMES.
            15 TMP-SEGMENT  PIC X.

01 TMP-SCORE    PIC X.

01 TMP-RESULTAT   PIC 9(02).

01 IDX-SEG  PIC 9 VALUE 1.
01 IDX-RECHERCHE  PIC 9(02) VALUE 1.
    88 TROUVE   VALUE 51.

01 WS-RESOLUTION PIC 9 VALUE 0.
    88 NON-RESOLU VALUE 0.
    88 RESOLU     VALUE 1.
    88 IMPOSSIBLE VALUE 2.

PROCEDURE DIVISION.
    OPEN INPUT SYSIN
    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ
    CLOSE SYSIN

    UNSTRING ln DELIMITED BY " " INTO
        SCORE-1
        SCORE-2
        SCORE-3
    END-UNSTRING

    MOVE FUNCTION NUMVAL(SCORE-1) TO CHIFFRE-1
    MOVE FUNCTION NUMVAL(SCORE-2) TO CHIFFRE-2
    MOVE FUNCTION NUMVAL(SCORE-3) TO RESULTAT

    COMPUTE TMP-RESULTAT = CHIFFRE-1 + CHIFFRE-2
    IF TMP-RESULTAT = RESULTAT THEN
        MOVE 2 TO WS-RESOLUTION
    END-IF

    MOVE SCORE-1 TO TMP-SCORE
    MOVE 1 TO IDX-ELEMENT

    PERFORM CALCULER-CHANGEMENT THRU FIN-CALCULER-CHANGEMENT

    IF NON-RESOLU THEN
        MOVE FUNCTION NUMVAL(SCORE-1) TO CHIFFRE-1
    END-IF

    MOVE SCORE-2 TO TMP-SCORE
    MOVE 2 TO IDX-ELEMENT

    PERFORM CALCULER-CHANGEMENT THRU FIN-CALCULER-CHANGEMENT

    IF NON-RESOLU THEN
        MOVE FUNCTION NUMVAL(SCORE-2) TO CHIFFRE-2
    END-IF

    MOVE SCORE-3 TO TMP-SCORE
    MOVE 3 TO IDX-ELEMENT

    PERFORM CALCULER-CHANGEMENT THRU FIN-CALCULER-CHANGEMENT

    IF NON-RESOLU OR IMPOSSIBLE THEN
        DISPLAY "Impossible"
    ELSE
        DISPLAY CHIFFRE-1 " " CHIFFRE-2 " " RESULTAT
    END-IF

    STOP RUN.

CALCULER-CHANGEMENT.

    IF RESOLU THEN
        GO TO FIN-CALCULER-CHANGEMENT
    END-IF.

    PERFORM CHERCHER-SEGMENT THRU FIN-CHERCHER-SEGMENT.

    PERFORM VARYING IDX-SEG FROM 1 BY 1 UNTIL IDX-SEG > 7 OR RESOLU
        IF TMP-SEGMENT(IDX-SEG) = "*" THEN
            MOVE "-" TO TMP-SEGMENT(IDX-SEG)
            PERFORM CHERCHER-CHIFFRE THRU FIN-CHERCHER-CHIFFRE

            IF TROUVE THEN

                MOVE FUNCTION NUMVAL(TMP-SCORE) TO WS-ELEMENT(IDX-ELEMENT)
                COMPUTE TMP-RESULTAT = CHIFFRE-1 + CHIFFRE-2
                IF TMP-RESULTAT = RESULTAT THEN
                    MOVE 1 TO WS-RESOLUTION
                END-IF

            END-IF
            MOVE "*" TO TMP-SEGMENT(IDX-SEG)
        ELSE
            MOVE "*" TO TMP-SEGMENT(IDX-SEG)
            PERFORM CHERCHER-CHIFFRE THRU FIN-CHERCHER-CHIFFRE

            IF TROUVE THEN

                MOVE FUNCTION NUMVAL(TMP-SCORE) TO WS-ELEMENT(IDX-ELEMENT)
                COMPUTE TMP-RESULTAT = CHIFFRE-1 + CHIFFRE-2
                IF TMP-RESULTAT = RESULTAT THEN
                    MOVE 1 TO WS-RESOLUTION
                END-IF

            END-IF
            MOVE "-" TO TMP-SEGMENT(IDX-SEG)
        END-IF
    END-PERFORM.

FIN-CALCULER-CHANGEMENT.
    EXIT.

CHERCHER-SEGMENT.

    PERFORM VARYING IDX-RECHERCHE FROM 1 BY 1 UNTIL IDX-RECHERCHE > 10
        IF TMP-SCORE = SEG-VAL(IDX-RECHERCHE) THEN
            MOVE SEG-REP(IDX-RECHERCHE) TO WS-TMP-SEGMENTS
            MOVE 50 TO IDX-RECHERCHE
        END-IF
    END-PERFORM.

FIN-CHERCHER-SEGMENT.
    EXIT.

CHERCHER-CHIFFRE.

    PERFORM VARYING IDX-RECHERCHE FROM 1 BY 1 UNTIL IDX-RECHERCHE > 10
        IF WS-TMP-SEGMENTS = SEG-REP(IDX-RECHERCHE) THEN
            MOVE SEG-VAL(IDX-RECHERCHE) TO TMP-SCORE
            MOVE 50 TO IDX-RECHERCHE
        END-IF
    END-PERFORM.

FIN-CHERCHER-CHIFFRE.
    EXIT.
