*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
    88 EOF VALUE HIGH-VALUES.

WORKING-STORAGE SECTION.

01 CONFIG.
    05 NB-COMMANDES     PIC 9(05).
    05 CHARGE-MAXIMALE  PIC 9(05).

01.
    05 OCCURS 10000 TIMES INDEXED BY IDX-COMMANDE.
        10.
            15 POSX PIC S9(06).
            15 POSY PIC S9(06).
        10 PIZZAS   PIC 9(04).

01.
    05 NB-PIZZAS    PIC 9(04)  VALUE 0.
    05 TMP-NB-PIZ   PIC 9(04)  VALUE 0.
    05 NB-INDEXES   PIC 9(05)  VALUE 1.
    05 RESULTAT.
        10 OCCURS 10000 TIMES INDEXED BY POS-INDEXES.
            15 INDEXES  PIC 9(05).

01 AFFICHAGE-SORTIE.
    05 SORTIE-TMP   PIC Z(04)9.
    05 SORTIE-PTR   PIC 9(05) BINARY.
    05 SORTIE-STR   PIC X(10000) VALUE SPACES.

PROCEDURE DIVISION.

    DISPLAY "===== START PROCEDURE =====" UPON SYSERR.

    OPEN INPUT SYSIN.
    PERFORM LIRE-LIGNE THRU FIN-LIRE-LIGNE.

    UNSTRING ln DELIMITED BY SPACE INTO
        NB-COMMANDES
        CHARGE-MAXIMALE
    END-UNSTRING.
    DISPLAY "Nb commandes = " NB-COMMANDES      UPON SYSERR.
    DISPLAY "Max charge   = " CHARGE-MAXIMALE   UPON SYSERR.

    PERFORM LIRE-LIGNE THRU FIN-LIRE-LIGNE.

    PERFORM VARYING IDX-COMMANDE FROM 1 BY 1 UNTIL EOF
        UNSTRING ln DELIMITED BY SPACE INTO
            POSX(IDX-COMMANDE)
            POSY(IDX-COMMANDE)
            PIZZAS(IDX-COMMANDE)
        END-UNSTRING

        PERFORM LIRE-LIGNE THRU FIN-LIRE-LIGNE
    END-PERFORM.

    CLOSE SYSIN.

    PERFORM VARYING IDX-COMMANDE FROM 1 BY 1 UNTIL IDX-COMMANDE > NB-COMMANDES
        COMPUTE TMP-NB-PIZ = (NB-PIZZAS + PIZZAS(IDX-COMMANDE))
        IF TMP-NB-PIZ > CHARGE-MAXIMALE THEN
            PERFORM AFFICHER-INDEXES THRU FIN-AFFICHER-INDEXES
            MOVE 1 TO NB-INDEXES
            MOVE PIZZAS(IDX-COMMANDE) TO TMP-NB-PIZ
        END-IF
        MOVE TMP-NB-PIZ TO NB-PIZZAS
        MOVE IDX-COMMANDE TO INDEXES(NB-INDEXES)
        SUBTRACT 1 FROM INDEXES(NB-INDEXES)
        ADD 1 TO NB-INDEXES
    END-PERFORM.

    IF NB-INDEXES > 0 THEN
        PERFORM AFFICHER-INDEXES THRU FIN-AFFICHER-INDEXES
    END-IF.

    STOP RUN.

LIRE-LIGNE.
    READ SYSIN
        AT END SET EOF TO TRUE
    END-READ.
FIN-LIRE-LIGNE.
    EXIT.

AFFICHER-INDEXES.
    MOVE SPACES TO SORTIE-STR.
    MOVE 1      TO SORTIE-PTR.

    PERFORM VARYING POS-INDEXES FROM 1 BY 1 UNTIL POS-INDEXES >= NB-INDEXES
        MOVE INDEXES(POS-INDEXES) TO SORTIE-TMP
        STRING
            FUNCTION TRIM(SORTIE-TMP)
            INTO SORTIE-STR WITH POINTER SORTIE-PTR
        END-STRING
        ADD 1 TO SORTIE-PTR
    END-PERFORM.
    DISPLAY SORTIE-STR.
FIN-AFFICHER-INDEXES.
    EXIT.
