*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
    88 EOF VALUE HIGH-VALUES.

WORKING-STORAGE SECTION.

01 DIMENSIONS.
    05 TAILLE-X    PIC 9(02).
    05 TAILLE-Y    PIC 9(02).

01 CARTE.
    05 C-COLONNES  OCCURS 30 TIMES.
        10 C-LIGNE  PIC X(30).
        10 C-LIGNE-DEC   REDEFINES C-LIGNE.
            15 C-CHAR-L   OCCURS 30 TIMES.
                20 C-CHAR   PIC X.

01 C-IDX    PIC 9(02) VALUE 1.
01 C-IDX-I  PIC 9(02) VALUE 1.

01 TMP.
    05 TMP-X    PIC 9(02).
    05 TMP-Y    PIC 9(02).

01 WS-JARDIN-PLACE  PIC 9 VALUE 0.
    88 JARDIN-ABSENT    VALUE 0.

PROCEDURE DIVISION.
    OPEN INPUT SYSIN
    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ

    UNSTRING ln DELIMITED BY " " INTO
        TAILLE-X
        TAILLE-Y
    END-UNSTRING

    READ SYSIN
        AT END SET EOF TO TRUE
    END-READ
    PERFORM UNTIL EOF
        MOVE ln TO C-LIGNE(C-IDX)
        ADD 1 TO C-IDX
        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ
    END-PERFORM
    CLOSE SYSIN

    PERFORM VARYING C-IDX FROM 1 BY 1 UNTIL C-IDX >= TAILLE-X
        PERFORM VARYING C-IDX-I FROM 1 BY 1 UNTIL C-IDX-I >= TAILLE-Y
            IF C-CHAR(C-IDX, C-IDX-I) = "." THEN

                COMPUTE TMP-X = C-IDX   + 1
                COMPUTE TMP-Y = C-IDX-I + 1

                IF C-CHAR(C-IDX, TMP-Y) = "." AND C-CHAR(TMP-X, C-IDX-I) = "." AND C-CHAR(TMP-X, TMP-Y) = "." THEN
                    DISPLAY "JARDIN POSSIBLE AUX COORDS (" C-IDX ", " C-IDX-I ")" UPON SYSERR

                    MOVE "O" TO C-CHAR(C-IDX, C-IDX-I )
                    MOVE "O" TO C-CHAR(C-IDX, TMP-Y   )
                    MOVE "O" TO C-CHAR(TMP-X, C-IDX-I )
                    MOVE "O" TO C-CHAR(TMP-X, TMP-Y   )

                    SET C-IDX   TO TAILLE-X
                    SET C-IDX-I TO TAILLE-Y

                    MOVE 1   TO WS-JARDIN-PLACE
                END-IF
            END-IF
        END-PERFORM
    END-PERFORM

    IF JARDIN-ABSENT THEN
        DISPLAY "Impossible"
    ELSE
        PERFORM VARYING C-IDX FROM 1 BY 1 UNTIL C-IDX > TAILLE-X
            DISPLAY C-LIGNE(C-IDX)
        END-PERFORM
    END-IF

    STOP RUN.
