*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
    88 EOF VALUE HIGH-VALUES.
WORKING-STORAGE SECTION.

01 NB-RECETTES  PIC 9(02).

01.
    05 OCCURS 3 TIMES INDEXED BY IDX-PART-RECETTE.
        10 RECETTE-ING  PIC X(64).

01.
    05 INGREDIENTS OCCURS 60 TIMES INDEXED BY IDX-INGREDIENT.
        10 INGREDIENT   PIC X(64).

01 WS-EXISTANCE PIC 9.
    88 NOUVEL-INGREDIENT    VALUE 0.
    88 DEJA-LISTE           VALUE 1.

01 COMPTE-INGREDIENTS   PIC 9(02) VALUE 0.

01 AFF-COMPTE-INGREDIENTS   PIC Z9.

PROCEDURE DIVISION.
    OPEN INPUT SYSIN

    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ
    MOVE FUNCTION NUMVAL(ln) TO NB-RECETTES

    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ
    PERFORM UNTIL EOF
        UNSTRING ln DELIMITED BY SPACE INTO
            RECETTE-ING(1)
            RECETTE-ING(2)
            RECETTE-ING(3)
        END-UNSTRING

        PERFORM VARYING IDX-PART-RECETTE FROM 1 BY 1 UNTIL IDX-PART-RECETTE > 3
            MOVE 0 TO WS-EXISTANCE
            DISPLAY "LOOKING UP '" RECETTE-ING(IDX-PART-RECETTE) "'..." UPON SYSERR
            MOVE 1 TO IDX-INGREDIENT
            SEARCH INGREDIENTS VARYING IDX-INGREDIENT
                WHEN INGREDIENT(IDX-INGREDIENT) = RECETTE-ING(IDX-PART-RECETTE)
                   MOVE 1 TO WS-EXISTANCE
            END-SEARCH
            DISPLAY "---- RESULT FOUND (OR NOT: " WS-EXISTANCE ") AT " IDX-INGREDIENT UPON SYSERR
            IF NOUVEL-INGREDIENT THEN
                ADD 1 TO COMPTE-INGREDIENTS
                MOVE RECETTE-ING(IDX-PART-RECETTE) TO INGREDIENT(COMPTE-INGREDIENTS)
            END-IF
        END-PERFORM

        READ SYSIN
            AT END SET EOF TO TRUE
        END-READ
    END-PERFORM
    CLOSE SYSIN

    MOVE COMPTE-INGREDIENTS TO AFF-COMPTE-INGREDIENTS
    DISPLAY AFF-COMPTE-INGREDIENTS

    STOP RUN.
