*> THE SAMPLE CODE BELOW OUTPUTS WHAT IS READ ON STDIN
*> use DISPLAY "Hello stderr world" UPON SYSERR to output debugging information to stderr
IDENTIFICATION DIVISION.
PROGRAM-ID. APP.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.

    SELECT SYSIN ASSIGN TO KEYBOARD ORGANIZATION LINE SEQUENTIAL.

DATA DIVISION.
FILE SECTION.

FD SYSIN.
01 ln PIC X(255).
    88 EOF VALUE HIGH-VALUES.

WORKING-STORAGE SECTION.

01 SCORES.
    05 SCORE-MOI    PIC 9(04).
    05 SCORE-TOI    PIC 9(04).

01 PANNIERS     PIC ZZZ9.

PROCEDURE DIVISION.
    OPEN INPUT SYSIN
    READ SYSIN
      AT END SET EOF TO TRUE
    END-READ
    CLOSE SYSIN
    UNSTRING ln DELIMITED BY "-" INTO
        SCORE-MOI
        SCORE-TOI
    END-UNSTRING

    COMPUTE PANNIERS = (SCORE-MOI - (SCORE-TOI + 3)) / 3

    DISPLAY PANNIERS
    STOP RUN.
